#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: README
#+date: <2021-09-19 Sun>
#+author:
#+email: mnasoft@gmail.com
#+language: ru
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.2 (Org mode 9.4.4)
#+options: html-link-use-abs-url:nil html-postamble:auto
#+options: html-preamble:t html-scripts:t html-style:t
#+options: html5-fancy:nil tex:t
#+html_doctype: xhtml-strict
#+html_container: div
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head:
#+html_head_extra:
#+subtitle:
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)
#+latex_header:
* ДЛО
* Поиск файла тренда в каталоге                                    :noexport: 
 Функция =r/dir:find-trd-by-utime-dirname= возвращает объект тренда,
для которого существуют данные на момент универсального времени utime
в каталоге dir-name.
#+name: recoder-dir-find-trd-by-utime-dirname   
#+BEGIN_SRC lisp :exports both
  ;;"D:/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/"
  (defparameter *trd*
    (r/dir:find-trd-by-utime-dirname
    (recoder/trd:time-universal-encode 2018 11 06 09 23 50)
    (namestring
     (merge-pathnames #P"trd/"
                      (asdf:system-source-directory :recoder)))))

  (recoder/org:header *trd*)
#+END_SRC

#+RESULTS: recoder-dir-find-trd-by-utime-dirname
| Файл                                | D:/home/_namatv/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                                       2 |
| Дата создания тренда                |                                                                                              2018-11-06 |
| Время создания тренда               |                                                                                                09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                                     415 |
| Общее число записей в тренде        |                                                                                                   15706 |
| Интервал между записями тренда      |                                                                                                  0.25d0 |
| Количество аналоговых сигналов      |                                                                                                     314 |
| Количество дискретных сигналов      |                                                                                                     101 |

* Формирование списка сигналов из списка имен сигналов             :noexport: 
#+BEGIN_SRC lisp :exports both

  (defparameter *signal-string-list*
    (loop :for key :being :the :hash-keys :in (recoder/trd:analog-ht *trd*)
          :for i :from 1 :to 5
          :collect key))
  (recoder/slist:a-signals *trd* *signal-string-list*)
#+END_SRC

#+RESULTS:
: (#a-s(0 "FP510" [0.0d0 1.600000023841858d0] "МПа" "Избыточное давление газа перед суммирующ")
:  #a-s(1 "FP520" [0.0d0 16.0d0] "кПа" "Перепад давления газа на суммирующем РУ")
:  #a-s(2 "FP530" [0.0d0 1000.0d0] "кПа" "Избыточное давление топливного газа пере")
:  #a-s(3 "FP550" [0.0d0 1000.0d0] "кПа" "Избыточное давление топливного газа пере")
:  #a-s(4 "FP560" [0.0d0 6.0d0] "кПа" "Перепад давления топливного газа на РУ 2"))

* Извлечение данных из тренда                                      :noexport: 
** Создание списка сигналов
#+name: s-names
#+begin_src lisp :exports both
  (defparameter *trd* recoder/trd:*trd*)
  (defparameter *s-names* '("V2" "P02" "T2" "ET300" "FA530" "FK526" "FA526" "FA566" "KAZNA-SCHO"))
  ,*s-names*
#+end_src

#+RESULTS: s-names
| V2 | P02 | T2 | ET300 | FA530 | FK526 | FA526 | FA566 | KAZNA-SCHO |

 Возвращает список аналоговых сигналов тренда trd, которые
 соответствуют списку обозначений сигналов из списка
 signal-string-list

*recoder:trd-discret-signal-list* (x trd) signal-string-list

Возвращает список дискретных сигналов тренда trd, которые
соответствуют списку обозначений сигналов из списка signal-string-list

*** Аналоговых
#+name: a-signals    
#+begin_src lisp :var s-names=s-names :exports both
  (defparameter *a-signals*
    (recoder/slist:a-signals *trd* *s-names*))

  ,*a-signals*
#+end_src

#+RESULTS: a-signals
: (#a-s(30 "V2" [0.0d0 25.0d0] "м3/с" "Объемный расход воздуха")
:  #a-s(89 "P02" [0.0d0 1000000.0d0] "Па" "Полное давление на входе в КС")
:  #a-s(24 "T2" [-10.0d0 600.0d0] "°C" "Т2 - средняя")
:  #a-s(25 "ET300" [0.0d0 1600.0d0] "°C" "Т3 - средняя"))

*** Дискретых
#+name: d-signals    
#+begin_src lisp :var s-names=s-names :exports both
  (defparameter *d-signals*
    (recoder/slist:d-signals *trd* *s-names*))

  ,*d-signals*
#+end_src

#+RESULTS: d-signals
: (#d-s(18 "FA530" "Кран грубой регулировки топливного газа ")
:  #d-s(47 "FK526" "Кран №42 топливного газа крановой площад")
:  #d-s(55 "FA526" "Кран грубой регулировки топливного газа ")
:  #d-s(63 "FA566" "Кран тонкой регулировки топливного газа "))

** Извлечение аналоговых сигналов
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-by-record recoder/trd:*trd* 1000 *a-signals*)
#+end_src

#+RESULTS:
| 0.13962005035477226d0 | 105607.69054703593d0 | 13.577172503242544d0 | 16.552986953536276d0 |

#+name: recoder-get-trd-analog-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-by-utime *trd* (+ (recoder/trd:utime-start *trd*) 250) *a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-by-utime
| 0.13962005035477226d0 | 105607.69054703593d0 | 13.577172503242544d0 | 16.552986953536276d0 |

#+name: recoder-get-trd-analog-mid-by-utime 
#+begin_src lisp :var a-signals=a-signals :exports both
  (r/get:trd-analog-mid-by-utime *trd* (+ (r/trd:utime-start *trd*) 250) *a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-mid-by-utime
| 0.13769450711542722d0 | 105569.90630233937d0 | 13.583377838813865d0 | 15.976341249859217d0 |

#+name: recoder-get-trd-analog-mid-by-snames
#+begin_src lisp :var a-signals=a-signals :exports both
  (r/get:trd-analog-mid-by-snames *trd* (+ (r/trd:utime-start *trd*) 250) *s-names*)
#+end_src

#+RESULTS: recoder-get-trd-analog-mid-by-snames
| 0.13769450711542722d0 | 105569.90630233937d0 | 13.583377838813865d0 | 15.976341249859217d0 |
  
Возвращает список средних значений параметров, записанных в тренде trd
в момент времени utime для списка сигналов, определяемых их именами
snames.

Осреднение происходит в интервале записей от  n-before до n-after.

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-stddev-by-utime recoder/trd:*trd*
                                          (+ (recoder/trd:utime-start recoder/trd:*trd*) 250)
                                          ,*a-signals*)
#+end_src

#+RESULTS: recoder-get-trd-analog-stddev-by-utime
| 0.0018668003573623427d0 | 39.08783871633869d0 | 0.03398802269302918d0 | 1.126388905374254d0 |

#+name: recoder-get-trd-analog-stddev-by-utime
#+begin_src lisp :var a-signals=a-signals :exports both
  (recoder/get:trd-analog-stddev-by-snames recoder/trd:*trd*
                                          (+ (recoder/trd:utime-start recoder/trd:*trd*) 250)
                                           ,*s-names*)
#+end_src

*** Пример извлечения сигналов из тренда
    
#+name: make-table
#+begin_src lisp :var a-signals=a-signals :exports both
  (defparameter *utime*
    (loop :for ut :from (recoder/trd:utime-start recoder/trd:*trd*) :to (recoder/trd:utime-end recoder/trd:*trd*)
          :by (floor (- (recoder/trd:utime-end recoder/trd:*trd*) (recoder/trd:utime-start recoder/trd:*trd*))
                     100)
          :collect ut))

  (mnas-format:round-2d-list 
    (append
     (list (mapcar #'recoder/a-signal:<a-signal>-id *a-signals*))
     (list (mapcar #'recoder/a-signal:<a-signal>-units *a-signals*))
     (mapcar
      #'(lambda (ut)
          (r/get:trd-analog-by-utime  recoder/trd:*trd* ut *a-signals*))
      ,*utime*)))
#+end_src

#+RESULTS: make-table
|     V2 |      P02 |    T2 | ET300 |
|   м3/с |       Па |    °C |    °C |
| 0.1869 | 1.079d+5 | 11.61 | 1.660 |
| 0.1858 | 1.078d+5 | 12.50 | 2.271 |
| 0.1678 | 1.074d+5 | 12.99 | 2.197 |
| 0.1427 | 1.053d+5 | 12.67 | 2.319 |
| 0.1427 | 1.053d+5 | 12.97 | 2.246 |
| 0.1396 | 1.054d+5 | 13.23 | 3.442 |
| 0.1381 | 1.056d+5 | 13.44 | 10.23 |
| 0.1335 | 1.057d+5 | 13.65 | 46.09 |
| 0.1331 | 1.061d+5 | 13.84 | 130.2 |
| 0.1255 | 1.065d+5 | 14.05 | 421.8 |
| 0.1396 | 1.055d+5 | 14.36 | 17.80 |
| 0.1385 | 1.054d+5 | 14.55 | 3.149 |
| 0.1385 | 1.054d+5 | 14.78 | 2.222 |
| 0.1385 | 1.056d+5 | 14.97 | 15.09 |
| 0.1369 | 1.058d+5 | 15.18 | 65.48 |
| 0.1259 | 1.065d+5 | 15.39 | 408.6 |
| 0.1259 | 1.066d+5 | 15.51 | 439.6 |
| 0.1228 | 1.066d+5 | 15.72 | 454.5 |
| 0.1385 | 1.055d+5 | 16.03 | 76.93 |
| 0.1385 | 1.057d+5 | 16.21 | 27.71 |
| 0.1343 | 1.058d+5 | 16.54 | 153.7 |
| 0.1209 | 1.069d+5 | 16.61 | 579.0 |
| 0.1225 | 1.069d+5 | 16.75 | 579.5 |
| 0.1328 | 1.058d+5 | 16.89 | 186.8 |
| 0.1457 | 1.059d+5 | 17.46 | 18.73 |
| 0.1511 | 1.060d+5 | 17.74 | 4.395 |
| 0.1526 | 1.059d+5 | 18.05 | 2.417 |
| 0.1526 | 1.059d+5 | 18.26 | 2.393 |
| 0.1511 | 1.062d+5 | 18.44 | 17.11 |
| 0.1347 | 1.074d+5 | 18.70 | 482.8 |
| 0.1526 | 1.061d+5 | 18.85 | 50.39 |
| 0.1530 | 1.059d+5 | 19.10 | 6.275 |
| 0.1541 | 1.060d+5 | 19.36 | 2.759 |
| 0.1236 | 1.084d+5 | 19.39 | 802.8 |
| 0.1484 | 1.063d+5 | 19.48 | 178.8 |
| 0.1526 | 1.060d+5 | 19.83 | 17.31 |
| 0.1514 | 1.062d+5 | 20.14 | 21.02 |
| 0.1366 | 1.075d+5 | 20.32 | 469.0 |
| 0.1350 | 1.074d+5 | 20.37 | 520.2 |
| 0.1366 | 1.075d+5 | 20.63 | 482.4 |
| 0.1530 | 1.061d+5 | 21.01 | 45.56 |
| 0.1541 | 1.060d+5 | 21.12 | 7.276 |
| 0.1545 | 1.059d+5 | 21.41 | 3.247 |
| 0.1530 | 1.060d+5 | 21.54 | 2.710 |
| 0.1545 | 1.059d+5 | 21.83 | 2.466 |
| 0.1549 | 1.059d+5 | 22.08 | 2.515 |
| 0.1549 | 1.059d+5 | 22.23 | 2.515 |
| 0.1549 | 1.059d+5 | 22.42 | 2.661 |
| 0.1522 | 1.059d+5 | 22.60 | 2.539 |
| 0.1534 | 1.061d+5 | 22.89 | 15.01 |
| 0.1492 | 1.063d+5 | 22.98 | 57.33 |
| 0.1369 | 1.075d+5 | 23.24 | 477.9 |
| 0.1358 | 1.074d+5 | 23.24 | 496.0 |
| 0.1373 | 1.075d+5 | 23.43 | 494.8 |
| 0.1389 | 1.073d+5 | 23.56 | 420.4 |
| 0.1537 | 1.061d+5 | 23.92 | 24.98 |
| 0.1507 | 1.065d+5 | 24.20 | 97.95 |
| 0.1446 | 1.070d+5 | 24.27 | 222.2 |
| 0.1373 | 1.074d+5 | 24.48 | 449.7 |
| 0.1553 | 1.061d+5 | 24.72 | 31.10 |
| 0.1686 | 1.067d+5 | 25.04 | 6.372 |
| 0.2018 | 1.087d+5 | 25.42 | 3.711 |
| 0.1957 | 1.086d+5 | 25.45 | 3.003 |
| 0.2010 | 1.087d+5 | 25.89 | 2.905 |
| 0.1957 | 1.089d+5 | 25.96 | 26.68 |
| 0.1946 | 1.090d+5 | 26.20 | 47.10 |
| 0.1907 | 1.094d+5 | 26.39 | 98.93 |
| 0.1637 | 1.106d+5 | 26.48 | 564.5 |
| 0.1987 | 1.088d+5 | 26.62 | 23.24 |
| 0.1968 | 1.090d+5 | 26.86 | 34.03 |
| 0.1686 | 1.107d+5 | 26.97 | 568.7 |
| 0.1675 | 1.107d+5 | 27.09 | 572.3 |
| 0.1991 | 1.087d+5 | 27.26 | 28.88 |
| 0.2014 | 1.087d+5 | 27.44 | 6.079 |
| 0.2007 | 1.086d+5 | 27.65 | 3.784 |
| 0.2026 | 1.087d+5 | 27.82 | 3.467 |
| 0.2007 | 1.088d+5 | 28.03 | 15.45 |
| 0.1949 | 1.092d+5 | 28.15 | 73.05 |
| 0.1915 | 1.095d+5 | 28.31 | 116.7 |
| 0.1690 | 1.106d+5 | 28.24 | 506.4 |
| 0.1690 | 1.106d+5 | 28.38 | 532.1 |
| 0.1957 | 1.087d+5 | 28.62 | 35.25 |
| 0.2029 | 1.087d+5 | 28.81 | 7.056 |
| 0.1991 | 1.085d+5 | 28.95 | 4.175 |
| 0.2022 | 1.086d+5 | 29.11 | 3.711 |
| 0.1953 | 1.092d+5 | 29.37 | 71.97 |
| 0.1644 | 1.106d+5 | 29.21 | 561.9 |
| 0.1637 | 1.105d+5 | 29.18 | 551.5 |
| 0.1709 | 1.105d+5 | 29.48 | 517.2 |
| 0.2033 | 1.088d+5 | 29.72 | 21.85 |
| 0.1984 | 1.087d+5 | 29.96 | 6.250 |
| 0.1968 | 1.091d+5 | 30.05 | 57.94 |
| 0.1946 | 1.091d+5 | 30.10 | 103.7 |
| 0.1923 | 1.093d+5 | 30.24 | 117.0 |
| 0.1820 | 1.097d+5 | 30.29 | 255.5 |
| 0.1682 | 1.107d+5 | 30.43 | 552.8 |
| 0.1671 | 1.106d+5 | 30.33 | 579.4 |
| 0.1686 | 1.107d+5 | 30.50 | 565.1 |
| 0.2502 | 1.126d+5 | 31.50 | 41.11 |
| 0.3681 | 1.261d+5 | 35.08 | 7.349 |
| 0.4974 | 1.576d+5 | 34.98 | 5.054 |

** Извлечение дискретных сигналов
*recoder:trd-discret-by-rec-number*       (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде 0 или 1.

*recoder:trd-discret-by-rec-number-t-nil* (trd trd) rec-number d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи с номером rec-number тренда trd в виде NIL или T.

*recoder:trd-discret-by-utime*            (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде 0 или 1.

*recoder:trd-discret-by-utime-t-nil*      (trd trd) utime      d-signal-list

Извлечение дискретных сигналов, заданных списком d-signal-list, из записи соответствующей времени utime тренда trd в виде NIL или T.

* Примеры использования                                            :noexport: 

#+BEGIN_SRC lisp :results output
  recoder/trd:*trd*
#+END_SRC

** ORG
#+name:recoder-org-header
#+begin_src lisp :exports both
  (recoder/org:header recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-header
| Файл                                | D:/home/_namatv/PRG/msys64/home/namatv/quicklisp/local-projects/clisp/recoder/trd/2018-11-06_092329.trd |
| Версия тренда                       |                                                                                                       2 |
| Дата создания тренда                |                                                                                              2018-11-06 |
| Время создания тренда               |                                                                                                09:23:29 |
| К-во аналоговых+дискретных сигналов |                                                                                                     415 |
| Общее число записей в тренде        |                                                                                                   15706 |
| Интервал между записями тренда      |                                                                                                  0.25d0 |
| Количество аналоговых сигналов      |                                                                                                     314 |
| Количество дискретных сигналов      |                                                                                                     101 |
   
#+name:recoder-org-analog-signals
#+begin_src lisp :exports both
  (recoder/org:a-signals recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-analog-signals
|   0 | FP510    |   0.0d0 | 1.600000023841858d0 | МПа     | Избыточное давление газа перед суммирующ |
|   1 | FP520    |   0.0d0 |              16.0d0 | кПа     | Перепад давления газа на суммирующем РУ  |
|   2 | FP530    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   3 | FP550    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   4 | FP560    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 2 |
|   5 | FP570    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   6 | FP580    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 3 |
|   7 | FP590    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа пере |
|   8 | FP600    |   0.0d0 |              10.0d0 | кПа     | Перепад давления топливного газа на РУ 4 |
|   9 | FP610    |   0.0d0 |             600.0d0 | кПа     | Избыточное давление топливного газа в 1- |
|  10 | FP620    |   0.0d0 |             600.0d0 | кПа     | Избыточное давление топливного газа во 2 |
|  11 | FP540    |   0.0d0 |               6.0d0 | кПа     | Перепад давления топливного газа на РУ 1 |
|  12 | FP630    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа в 3- |
|  13 | FP640    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление топливного газа в 4- |
|  14 | FT510    | -50.0d0 |             150.0d0 | °С      | Температура топливного газа в распредели |
|  15 | PP030    |   0.0d0 |              16.0d0 | кПа     | Перепад давления воздуха на РУ левой вет |
|  16 | PP020    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
|  17 | PP040    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
|  18 | PP050    |   0.0d0 |              16.0d0 | кПа     | Перепад давления воздуха на РУ правой ве |
|  19 | PT060    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  20 | PT070    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  21 | PT180    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  22 | PT080    |   0.0d0 |             600.0d0 | °C      | Температура технологического воздуха пер |
|  23 | FT500    | -50.0d0 |             150.0d0 | °C      | Температура топливного газа перед суммир |
|  24 | T2       | -10.0d0 |             600.0d0 | °C      | Т2 - средняя                             |
|  25 | ET300    |   0.0d0 |            1600.0d0 | °C      | Т3 - средняя                             |
|  26 | ET301    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т1                   |
|  27 | ET302    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т2                   |
|  28 | ET303    |   0.0d0 |            1300.0d0 | °C      | Температура Т3 (ХА) т3                   |
|  29 | Gv       |   0.0d0 |              25.0d0 | кг/ч    | Расход воздуха на входе в КС             |
|  30 | V2       |   0.0d0 |              25.0d0 | м3/с    | Объемный расход воздуха                  |
|  31 | G_1      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 1-м канале                      |
|  32 | G_2      |   0.0d0 |            1000.0d0 | кг/ч    | Расход во 2-м канале                     |
|  33 | G_3      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 3-м канале                      |
|  34 | G_4      |   0.0d0 |            1000.0d0 | кг/ч    | Расход в 4-м канале                      |
|  35 | Gt       |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расчетный расход топлива       |
|  36 | G1       |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расход топлива                 |
|  37 | Gvv      |   0.0d0 |           10000.0d0 | кг/ч    | Расход воздуха высокого давления         |
|  38 | G        |   0.0d0 |           10000.0d0 | кг/ч    | массовый расход газа                     |
|  39 | dPx      |   0.0d0 |          100000.0d0 | Па      | перепад давления на сужающем устройстве  |
|  40 | Tx       |   0.0d0 |             100.0d0 | °C      | температура перед сужающим устройством   |
|  41 | Px       |   0.0d0 |         1000000.0d0 | Па      | давление перед сужающим устройством      |
|  42 | alpha    |   0.0d0 |            1000.0d0 |         | коэфициент расхода                       |
|  43 | eps      |   0.0d0 |            1000.0d0 |         | коэффициент расширения                   |
|  44 | rho      |   0.0d0 |            1000.0d0 |         | плотность газа                           |
|  45 | Pk       |   0.0d0 |               1.0d7 | Па      | псевдокритическое давление               |
|  46 | Tk       |   0.0d0 |            1000.0d0 | K       | псевдокритич. температура                |
|  47 | mu       |   0.0d0 |             100.0d0 |         | динамическая вязкость природного газа    |
|  48 | mu0      |   0.0d0 |             100.0d0 |         | заданная динамическая вязкость           |
|  49 | kapa     |   0.0d0 |              10.0d0 |         | показатель адиабаты                      |
|  50 | kapa0    |   0.0d0 |              10.0d0 |         | заданный показатель адиабаты             |
|  51 | Re       |   0.0d0 |          100000.0d0 |         | число Рейнольдса                         |
|  52 | Re_n     |   0.0d0 |         1000000.0d0 |         | уточненное значение числа Рейнольдса     |
|  53 | err      |   0.0d0 |               1.0d0 |         | относит. ошибка определения числа Re     |
|  54 | D        |   0.0d0 |             100.0d0 |         | внутренний диаметр трубопровода          |
|  55 | d        |   0.0d0 |             100.0d0 | мм      | диаметр сужающего устройства             |
|  56 | ksh      |   0.0d0 |             100.0d0 |         | поправочный множитель на шероховатость   |
|  57 | ksh0     |   0.0d0 |             100.0d0 |         | заданный поправочный множитель...        |
|  58 | kp       |   0.0d0 |             100.0d0 |         | поправочный множитель на притупление вх  |
|  59 | kp0      |   0.0d0 |             100.0d0 |         | заданный поправочный множитель...        |
|  60 | m        |   0.0d0 |             100.0d0 |         | модуль СУ                                |
|  61 | m2       |   0.0d0 |             100.0d0 |         | квадрат модуля СУ                        |
|  62 | Kp       |   0.0d0 |            1000.0d0 |         | комплексный коэффициент приведения давле |
|  63 | Kt       |   0.0d0 |             100.0d0 |         | комплексный коэффициент приведения темпе |
|  64 | Ppp      |   0.0d0 |             100.0d0 |         | псевдоприведенное избыточное давление    |
|  65 | Tpp      |   0.0d0 |             100.0d0 |         | псевдоприведенная температура            |
|  66 | K        |   0.0d0 |             100.0d0 |         | коэффициент сжимаемости газа             |
|  67 | K0       |   0.0d0 |             100.0d0 |         | заданный коэффициент сжимаемости         |
|  68 | a        |   0.0d0 |               1.0d0 |         |                                          |
|  69 | b        |   0.0d0 |               1.0d0 |         |                                          |
|  70 | c        |   0.0d0 |               1.0d0 |         |                                          |
|  71 | T        |   0.0d0 |             500.0d0 |         | Температура на входе в мерное устройство |
|  72 | P        |   0.0d0 |         1000000.0d0 |         | Полное давление на входе в мерное устрой |
|  73 | CYType   |   0.0d0 |               1.0d0 |         | Тип мерного устройства (0-диафрагма;1-со |
|  74 | Fuel     |   0.0d0 |               1.0d0 |         | Вид топлива                              |
|  75 | G_1p     |   0.0d0 |             100.0d0 | %       | расход топлива в первом канале %         |
|  76 | G_2p     |   0.0d0 |             100.0d0 | %       | расход топлива во втором канале %        |
|  77 | G_3p     |   0.0d0 |             100.0d0 | %       | расход топлива в третьем канале %        |
|  78 | d20      |   0.0d0 |             500.0d0 | мм      | Внутренний диаметр СУ                    |
|  79 | D20      |   0.0d0 |             500.0d0 | мм      | Внутренний диаметр трубопровода          |
|  80 | rhon     |   0.0d0 |               5.0d0 |         | плотность среды                          |
|  81 | G_4p     |   0.0d0 |             100.0d0 | %       | Расход топлива в 4-ом канале             |
|  82 | T3max    |   0.0d0 |            1600.0d0 | °C      |                                          |
|  83 | teta_max |   0.0d0 |            1000.0d0 |         |                                          |
|  84 | deltaT   |   0.0d0 |            2000.0d0 | °C      |                                          |
|  85 | M2       |   0.0d0 |               1.0d0 |         | Число маха на входе в КС                 |
|  86 | M3       |   0.0d0 |               1.0d0 |         | Число Маха на выходе из КС               |
|  87 | W2       |   0.0d0 |            1000.0d0 | м/с     | Скорость воздуха на входе в КС           |
|  88 | W3       |   0.0d0 |            1000.0d0 | м/с     | Скорость продуктов сгорания на выходе из |
|  89 | P02      |   0.0d0 |         1000000.0d0 | Па      | Полное давление на входе в КС            |
|  90 | P03      |   0.0d0 |         1000000.0d0 | Па      | Полное давление на  выходе из КС         |
|  91 | ro2      |   0.0d0 |              10.0d0 | кг/м3   | плотность воздуха на входе в КС          |
|  92 | ro3      |   0.0d0 |              10.0d0 | кг/м3   | плотность продуктов сгорания             |
|  93 | alpha_v  |   0.0d0 |             100.0d0 |         | Коэффициент избытка воздуха              |
|  94 | C_pv     |   0.0d0 |             100.0d0 |         | Удельная теплоемость воздуха             |
|  95 | C_p3     |   0.0d0 |             100.0d0 |         | Удельная теплоемкость продуктов сгорания |
|  96 | G3       |   0.0d0 |           10000.0d0 |         | Расход продуктов сгорания                |
|  97 | dzeta    |   0.0d0 |              10.0d0 |         | коэффициент гидравлического сопротивлени |
|  98 | eta      |   0.0d0 |             100.0d0 |         | Коэффициент полноты сгорания             |
|  99 | kapa3    |   0.0d0 |              10.0d0 |         | Показатель адиабаты продуктов сгорания   |
| 100 | r        |   0.0d0 |             100.0d0 |         |                                          |
| 101 | ET001    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 102 | ET002    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 103 | ET003    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 104 | ET004    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 105 | ET005    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 106 | ET006    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 107 | ET007    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 108 | ET008    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 109 | ET009    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 110 | ET010    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 111 | ET011    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 112 | ET012    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 113 | ET013    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 114 | ET014    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 115 | ET015    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 116 | ET016    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 117 | ET017    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 118 | ET018    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 119 | ET019    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 120 | ET020    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 121 | ET021    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 122 | ET022    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 123 | ET023    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 124 | ET024    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 125 | ET025    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 126 | ET026    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 127 | ET027    |   0.0d0 |            1600.0d0 | °C      | Температура родуктов сгорания на выходе  |
| 128 | ET028    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 129 | ET029    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 130 | ET030    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 131 | ET031    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 132 | ET032    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 133 | ET033    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 134 | ET034    |   0.0d0 |            1600.0d0 | °C      | Температура продуктов сгорания на выходе |
| 135 | ET035    |   0.0d0 |            1600.0d0 | °C      | Температура прод. сгорания т.35          |
| 136 | ET036    |   0.0d0 |            1600.0d0 | °C      | Температура прод. сгорания т.36          |
| 137 | kapa_co  |   0.0d0 |               2.0d0 |         |                                          |
| 138 | P02_kg   |   0.0d0 |             100.0d0 | кгс/см2 | Полное давление на входе                 |
| 139 | P03_kg   |   0.0d0 |             100.0d0 | кгс/см2 | Полное давление на выходе                |
| 140 | Gsum     |   0.0d0 |          100000.0d0 | кг      | Суммарный расход топлива                 |
| 141 | PP090L   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 142 | PP090    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 143 | PP090R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление продуктов сгорания н |
| 144 | GsumDay  |   0.0d0 |           10000.0d0 | кг      | Суммарный расход топлива за 1 день       |
| 145 | VT001    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.1)       |
| 146 | VT002    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.2)       |
| 147 | VT003    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.3)       |
| 148 | VT004    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.4)       |
| 149 | VT005    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.5)       |
| 150 | VT006    |   0.0d0 |             100.0d0 | °C      | Температура охлаждающей воды (т.6)       |
| 151 | FR019    |   0.0d0 |           65535.0d0 |         | режим работы клапана пускового газа      |
| 152 | PP060L   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
| 153 | PP060    |   0.0d0 |             100.0d0 | кПа     | Избыточное давление воздуха на входе в К |
| 154 | PP061R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление воздуха на входе в К |
| 155 | PP060R   |   0.0d0 |             100.0d0 | кПа     | Избыточное давление технологического воз |
| 156 | F11      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 1 частота                  |
| 157 | F12      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 2 частота                  |
| 158 | F13      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 3 частота                  |
| 159 | F14      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 4 частота                  |
| 160 | F15      |   0.0d0 |           10000.0d0 | Гц      | Первый датчик 5 частота                  |
| 161 | F21      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 1 частота                  |
| 162 | F22      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 2 частота                  |
| 163 | F23      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 3 частота                  |
| 164 | F24      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 4 частота                  |
| 165 | F25      |   0.0d0 |           10000.0d0 | Гц      | Второй датчик 5 частота                  |
| 166 | F31      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 1 частота                  |
| 167 | F32      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 2 частота                  |
| 168 | F33      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 3 частота                  |
| 169 | F34      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 4 частота                  |
| 170 | F35      |   0.0d0 |           10000.0d0 | Гц      | Третий датчик 5 частота                  |
| 171 | A11      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 1 гармоника                |
| 172 | A12      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 2 гармоника                |
| 173 | A13      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 3 гармоника                |
| 174 | A14      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 4 гармоника                |
| 175 | A15      |   0.0d0 |              10.0d0 | кПа     | Первый датчик 4 гармоника                |
| 176 | A21      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 1 гармоника                |
| 177 | A22      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 2 гармоника                |
| 178 | A23      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 3 гармоника                |
| 179 | A24      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 4 гармоника                |
| 180 | A25      |   0.0d0 |              10.0d0 | кПа     | Второй датчик 5 гармоника                |
| 181 | A31      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 1 гармоника                |
| 182 | A32      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 2 гармоника                |
| 183 | A33      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 3 гармоника                |
| 184 | A34      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 4 гармоника                |
| 185 | A35      |   0.0d0 |              10.0d0 | кПа     | Третий датчик 5 гармоника                |
| 186 | A1       |   0.0d0 |               1.0d0 | кПа     | Первый  датчик осредненное значение гарм |
| 187 | A2       |   0.0d0 |              10.0d0 | кПа     | Второй датчик осредненное значение гармо |
| 188 | A3       |   0.0d0 |              10.0d0 | кПа     | Третий датчик осредненное значение гармо |
| 189 | FP010    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление ДТ за подкачивающим  |
| 190 | FP020    |   0.0d0 |              10.0d0 | МПа     | Избыточное давление ДТ за рабочим насосо |
| 191 | FP030    |   0.0d0 |               6.0d0 | МПа     | Избыточное давление ДТ в 1 канале        |
| 192 | FP040    |   0.0d0 |               6.0d0 | МПа     | Избыточное давление ДТ во 2 канале       |
| 193 | FP050    |   0.0d0 |            1000.0d0 | кПа     | Избыточное давление ДТ в пусковом канале |
| 194 | FT010    |   0.0d0 |             100.0d0 | °С      | Температура ДТ за рабочим насосом        |
| 195 | FG010    |   0.0d0 |             100.0d0 | кг/ч    | Расход ДТ первого канала                 |
| 196 | FG020    |   0.0d0 |             100.0d0 | кг/ч    | Расход ДТ второго канала                 |
| 197 | PP010    |   0.0d0 |             600.0d0 | кПа     | Давление технического воздуха            |
| 198 | VP010    |   0.0d0 |            1000.0d0 | кПа     | Давление воды                            |
| 199 | VT010    |   0.0d0 |             150.0d0 | °C      | Температура воды на сливе                |
| 200 | VG010    |   0.0d0 |            1000.0d0 | кг/ч    | Расход воды                              |
| 201 | FN010    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива (ТПР-1)  |
| 202 | FN020    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива (ТПР-2)  |
| 203 | FN040    |   0.0d0 |             500.0d0 | Гц      | Массовый расход жидкого топлива          |
| 204 | FN030    |   0.0d0 |             500.0d0 | Гц      | Массовый расход технологической воды (ТП |
| 205 | VN010    |   0.0d0 |            1000.0d0 | Гц      | Частота вращения турбинки расходомера во |
| 206 | T-1      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.1)             |
| 207 | T-2      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.2)             |
| 208 | T-3      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.3)             |
| 209 | T-4      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.4)             |
| 210 | T-5      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.5)             |
| 211 | T-6      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.6)             |
| 212 | T-7      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.7)             |
| 213 | T-8      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.8)             |
| 214 | T-9      |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.9)             |
| 215 | T-10     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.10)            |
| 216 | T-11     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.11)            |
| 217 | T-12     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.12)            |
| 218 | T-13     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.13)            |
| 219 | T-14     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.14)            |
| 220 | T-15     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.15)            |
| 221 | T-16     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.16)            |
| 222 | T-17     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.17)            |
| 223 | T-18     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.18)            |
| 224 | T-19     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.19)            |
| 225 | T-20     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.20)            |
| 226 | T-21     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.21)            |
| 227 | T-22     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.22)            |
| 228 | T-23     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.23)            |
| 229 | T-24     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.24)            |
| 230 | T-25     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.25)            |
| 231 | T-26     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.26)            |
| 232 | T-27     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.27)            |
| 233 | T-28     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.28)            |
| 234 | T-29     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.29)            |
| 235 | T-30     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.30)            |
| 236 | T-31     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.31)            |
| 237 | T-32     |   0.0d0 |            1300.0d0 | °C      | Температура деталей ОИ (т.32)            |
| 238 | Т-33     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.33                        |
| 239 | Т-34     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.34                        |
| 240 | Т-35     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.35                        |
| 241 | Т-36     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.36                        |
| 242 | Т-37     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.37                        |
| 243 | Т-38     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.38                        |
| 244 | Т-39     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.39                        |
| 245 | Т-40     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.40                        |
| 246 | Т-41     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.41                        |
| 247 | T-42     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.42                        |
| 248 | Т-43     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.43                        |
| 249 | Т-44     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.44                        |
| 250 | Т-45     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.45                        |
| 251 | Т-46     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.46                        |
| 252 | Т-47     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.47                        |
| 253 | Т-48     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.48                        |
| 254 | Т-49     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.49                        |
| 255 | Т-50     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.50                        |
| 256 | Т-51     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.51                        |
| 257 | Т-52     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.52                        |
| 258 | Т-53     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.53                        |
| 259 | Т-54     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.54                        |
| 260 | Т-55     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.55                        |
| 261 | Т-56     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.56                        |
| 262 | Т-57     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.57                        |
| 263 | Т-58     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.58                        |
| 264 | Т-59     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.59                        |
| 265 | Т-60     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.60                        |
| 266 | Т-61     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.61                        |
| 267 | Т-62     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.62                        |
| 268 | Т-63     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.63                        |
| 269 | Т-64     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.64                        |
| 270 | T-65     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.65                        |
| 271 | T-66     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.66                        |
| 272 | T-67     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.67                        |
| 273 | T-68     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.68                        |
| 274 | T-69     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.69                        |
| 275 | T-70     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.70                        |
| 276 | T-71     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.71                        |
| 277 | T-72     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.72                        |
| 278 | T-73     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.73                        |
| 279 | T-74     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.74                        |
| 280 | T-75     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.75                        |
| 281 | T-76     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.76                        |
| 282 | T-77     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.77                        |
| 283 | T-78     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.78                        |
| 284 | T-79     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.79                        |
| 285 | T-80     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.80                        |
| 286 | T-81     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па1                       |
| 287 | T-82     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па2                       |
| 288 | T-83     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.па3                       |
| 289 | T-84     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг1                       |
| 290 | T-85     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг2                       |
| 291 | T-86     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.пг3                       |
| 292 | T-87     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.87                        |
| 293 | T-88     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.88                        |
| 294 | T-89     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.89                        |
| 295 | T-90     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.90                        |
| 296 | T-91     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.91                        |
| 297 | T-92     |   0.0d0 |            1300.0d0 | °C      | Препарировка т.92                        |
| 298 | G_2k     |   0.0d0 |             250.0d0 | кг/ч    | Расход газа во 2 канале (CMF050)         |
| 299 | G_1k     |   0.0d0 |              60.0d0 | кг/ч    | Расход газа в 1 канале (CMF025)          |
| 300 | eta_kr   |   0.0d0 |             100.0d0 |         | Коэффициент полноты сгорания (кориолис)  |
| 301 | G3_kr    |   0.0d0 |           10000.0d0 |         | Расход продуктов сгорания (кориолис)     |
| 302 | Gdt      |   0.0d0 |            1000.0d0 | кг/ч    | Суммарный расход жидкого топлива         |
| 303 | Gg_otn   |   0.0d0 |             100.0d0 |         | Относительный расход газа                |
| 304 | Side     |   0.0d0 |               1.0d0 |         | Установка: Левая (Left)=0, Правая (Right |
| 305 | T2L      |   0.0d0 |            1000.0d0 | °C      | Т2 средняя левой ветки                   |
| 306 | Sd20_v   |   0.0d0 |            1000.0d0 |         | Внутренний диаметр СУ, мм                |
| 307 | SD20_v   |   0.0d0 |            1000.0d0 |         | Внутренний диаметр трубопровода, мм      |
| 308 | Sro_t    |   0.0d0 |               1.0d0 |         | Плотность газа при нормальных условиях   |
| 309 | SF3      |   0.0d0 |            1000.0d0 |         | Площадь сечения на выходе из КС, см2     |
| 310 | SQp      |   0.0d0 |           60000.0d0 |         | Низшая теплота сгорания                  |
| 311 | SB       |   0.0d0 |            1000.0d0 |         | Барометрическое давление, мм. рт. ст.    |
| 312 | T2R      |   0.0d0 |            1000.0d0 | °C      | Т2 средняя правой ветки                  |
| 313 | SF2      |   0.0d0 |            1000.0d0 |         | Площадь сечения на входе в кс, см2       |

#+name:recoder-org-discret-signals
#+begin_src lisp :exports both
  (recoder/org:d-signals recoder/trd:*trd*)
#+end_src

#+RESULTS: recoder-org-discret-signals
|   0 | FH020 | Дроссельный кран рабочего насоса ДТ - от |
|   1 | FH021 | Дроссельный кран рабочего насоса ДТ - за |
|   2 | FA010 | Кран регулировки подачи ДТ 1-го канала - |
|   3 | FA011 | Кран регулировки подачи ДТ 1-го канала - |
|   4 | FA020 | Кран регулировки подачи ДТ 2-го канала - |
|   5 | FA021 | Кран регулировки подачи ДТ 2-го канала - |
|   6 | FK510 | Кран №41 топливного газа крановой площад |
|   7 | FK511 | Кран №41 топливного газа крановой площад |
|   8 | FK520 | Кран №42 топливного газа крановой площад |
|   9 | FK521 | Кран №42 топливного газа крановой площад |
|  10 | FK530 | Кран №43 топливного газа крановой площад |
|  11 | FK531 | Кран №43 топливного газа крановой площад |
|  12 | FK540 | Кран №46 топливного газа крановой площад |
|  13 | FK541 | Кран №46 топливного газа крановой площад |
|  14 | FA510 | Кран грубой регулировки топливного газа  |
|  15 | FA511 | Кран грубой регулировки топливного газа  |
|  16 | FA520 | Кран грубой регулировки топливного газа  |
|  17 | FA521 | Кран грубой регулировки топливного газа  |
|  18 | FA530 | Кран грубой регулировки топливного газа  |
|  19 | FA531 | Кран грубой регулировки топливного газа  |
|  20 | FA540 | Кран грубой регулировки топливного газа  |
|  21 | FA541 | Кран грубой регулировки топливного газа  |
|  22 | FA550 | Кран тонкой регулировки топливного газа  |
|  23 | FA551 | Кран тонкой регулировки топливного газа  |
|  24 | FA560 | Кран тонкой регулировки топливного газа  |
|  25 | FA561 | Кран тонкой регулировки топливного газа  |
|  26 | FA570 | Кран тонкой регулировки топливного газа  |
|  27 | FA571 | Кран тонкой регулировки топливного газа  |
|  28 | FA580 | Кран тонкой регулировки топливного газа  |
|  29 | FA581 | Кран тонкой регулировки топливного газа  |
|  30 | NJ010 | Загазованность бокса 9  - порог 0.5%     |
|  31 | NJ020 | Загазованность бокса 9 - порог 1%        |
|  32 | PH030 | Задвижка технологического воздуха левой  |
|  33 | PH031 | Задвижка технологического воздуха левой  |
|  34 | PH040 | Задвижка технологического воздуха правой |
|  35 | PH041 | Задвижка технологического воздуха правой |
|  36 | FH026 | Дроссельный кран рабочего насоса ДТ - от |
|  37 | FH027 | Дроссельный кран рабочего насоса ДТ - за |
|  38 | FA016 | Кран регулировки подачи жидкого топлива  |
|  39 | FA017 | Кран регулировки подачи жидкого топлива  |
|  40 | FA026 | Кран регулировки подачи жидкого топлива  |
|  41 | FA027 | Кран регулировки подачи жидкого топлива  |
|  42 | FR017 | Агрегат зажигания - отключить            |
|  43 | FR016 | Агрегат зажигания - включить             |
|  44 | FR018 | Клапан пускового газа                    |
|  45 | FK516 | Кран №41 топливного газа крановой площад |
|  46 | FK517 | Кран №41 топливного газа крановой площад |
|  47 | FK526 | Кран №42 топливного газа крановой площад |
|  48 | FK527 | Кран №42 топливного газа крановой площад |
|  49 | FK536 | Кран №43 топливного газа крановой площад |
|  50 | FK537 | Кран №43 топливного газа крановой площад |
|  51 | FK546 | Кран №46 топливного газа крановой площад |
|  52 | FK547 | Кран №46 топливного газа крановой площад |
|  53 | FA516 | Кран грубой регулировки топливного газа  |
|  54 | FA517 | Кран грубой регулировки топливного газа  |
|  55 | FA526 | Кран грубой регулировки топливного газа  |
|  56 | FA527 | Кран грубой регулировки топливного газа  |
|  57 | FA536 | Кран грубой регулировки топливного газа  |
|  58 | FA537 | Кран грубой регулировки топливного газа  |
|  59 | FA546 | Кран грубой регулировки топливного газа  |
|  60 | FA547 | Кран грубой регулировки топливного газа  |
|  61 | FA556 | Кран тонкой регулировки топливного газа  |
|  62 | FA557 | Кран тонкой регулировки топливного газа  |
|  63 | FA566 | Кран тонкой регулировки топливного газа  |
|  64 | FA567 | Кран тонкой регулировки топливного газа  |
|  65 | FA576 | Кран тонкой регулировки топливного газа  |
|  66 | FA577 | Кран тонкой регулировки топливного газа  |
|  67 | FA586 | Кран тонкой регулировки топливного газа  |
|  68 | FA587 | Кран тонкой регулировки топливного газа  |
|  69 | FR010 | Агрегат зажигания - включен              |
|  70 | FR011 | Агрегат зажигания - отключен             |
|  71 | PH036 | Задвижка технологического воздуха левой  |
|  72 | PH037 | Задвижка технологического воздуха левой  |
|  73 | PH046 | Задвижка технологического воздуха правой |
|  74 | PH047 | Задвижка технологического воздуха правой |
|  75 | PM016 | Аварийная вентиляция - включить          |
|  76 | NJ030 | Загазованность бокса 9 - отказ           |
|  77 | FH036 | Клапан слива 1-го канала                 |
|  78 | FH046 | Клапан слива 2 -го канала                |
|  79 | GAS   | Газообразное топливо                     |
|  80 | OIL   | Жидкое топливо                           |
|  81 | FM010 | Топливный насос - включен                |
|  82 | FM011 | Топливный насос - отключен               |
|  83 | VM010 | Насос воды - включен                     |
|  84 | VM011 | Насос воды - отключен                    |
|  85 | PH010 | Кран регулировки подачи техн. воздуха -  |
|  86 | PH011 | Кран регулировки подачи техн. воздуха -  |
|  87 | VH010 | Кран регулировки подачи питьевой воды -  |
|  88 | VH011 | Кран регулировки подачи питьевой воды -  |
|  89 | FM016 | Рабочий насос ДТ - включить              |
|  90 | FM017 | Рабочий насос ДТ - отключить             |
|  91 | VM016 | Насос воды - включить                    |
|  92 | VM017 | Насос воды - отключить                   |
|  93 | PH016 | Кран регулировки подачи технического воз |
|  94 | PH017 | Кран регулировки подачи технического воз |
|  95 | VH016 | Кран регулировки подачи воды - открыть   |
|  96 | VH017 | Кран регулировки подачи воды - закрыть   |
|  97 | VH026 | Кран перепуска воды - открыть            |
|  98 | VH027 | Кран перепуска воды - закрыть            |
|  99 | FH010 | Кран подачи ДТ - открыт                  |
| 100 | FH011 | Кран подачи ДТ - закрыт                  |



